ТОИР_демо/src/Documents/торо_НастройкаРегистрацииНаработкиЗависимыхОР/торо_НастройкаРегистрацииНаработкиЗависимыхОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_НастройкаРегистрацииНаработкиЗависимыхОР</name>
  <registerRecords>InformationRegister.торо_НастройкаРегистрацииНаработкиЗависимыхОР</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_ОбъектаРемонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимыеОбъектыРемонта</name>
    <attributes>
      <name>ID_ВышестоящегоОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъектаРемонта</name>
      <type>
        <types>CatalogRef.торо_ТиповыеОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <comment>Зависимый объект ремонта</comment>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрНаработки</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПересчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВвода</name>
      <comment>Дата с какого момента начнут действовать эти коэффициенты. </comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_НастройкаРегистрацииНаработкиЗависимыхОР/торо_НастройкаРегистрацииНаработкиЗависимыхОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НастройкаРегистрацииНаработкиЗависимыхОР</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоэффициентПересчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗависимыйОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОРЗависимогоОбъектаРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеЗависимогоОР</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизацияЗависимогоОР</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеЗависимогоОР</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Documents/торо_НастройкаРегистрацииНаработкиЗависимыхОР/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("ОбъектыРемонта", "Объекты ремонта");
	СписокТЧ.Вставить("ЗависимыеОбъектыРемонта", "Часы ремонта");
	торо_ОбщегоНазначения.ПроверитьЗаполненностьТабличныхЧастей(ЭтотОбъект, СписокТЧ, Отказ);
	Если отказ тогда возврат; КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
		
	// регистр торо_НастройкаРегистрацииНаработкиЗависимыхОР
	Движения.торо_НастройкаРегистрацииНаработкиЗависимыхОР.Записывать = Истина;
	Движения.торо_НастройкаРегистрацииНаработкиЗависимыхОР.Очистить();
	ТаблицаЗависимыхОбъектовРемонта = ПолучитьТаблицуЗависимыхОбъектовРемонта(ОбъектыРемонта,ЗависимыеОбъектыРемонта);
	Для Каждого ТекСтрокаЗависимыеОбъектыРемонта Из ТаблицаЗависимыхОбъектовРемонта Цикл
		
		Движение = Движения.торо_НастройкаРегистрацииНаработкиЗависимыхОР.Добавить();
		
		Движение.Период = ТекСтрокаЗависимыеОбъектыРемонта.ДатаВвода;
		Движение.Дата = ТекСтрокаЗависимыеОбъектыРемонта.ДатаВвода;
		Движение.ОбъектРемонта = ТекСтрокаЗависимыеОбъектыРемонта.ОбъектРемонта;
		Движение.ОрганизацияЗависимогоОР = ТекСтрокаЗависимыеОбъектыРемонта.ОрганизацияЗависимогоОР;
		Движение.ПодразделениеЗависимогоОР = ТекСтрокаЗависимыеОбъектыРемонта.ПодразделениеЗависимогоОР;
		Движение.НаправлениеЗависимогоОР = ТекСтрокаЗависимыеОбъектыРемонта.НаправлениеЗависимогоОР;
		Движение.ТипОРЗависимогоОбъектаРемонта = ТекСтрокаЗависимыеОбъектыРемонта.ТипОРЗависимогоОбъектаРемонта;
		Движение.ЗависимыйОбъектРемонта = ТекСтрокаЗависимыеОбъектыРемонта.ЗависимыйОбъектРемонта;
		Движение.ПараметрНаработки = ТекСтрокаЗависимыеОбъектыРемонта.ПараметрНаработки;
		Движение.КоэффициентПересчета = ТекСтрокаЗависимыеОбъектыРемонта.КоэффициентПересчета;
		
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьТаблицуЗависимыхОбъектовРемонта(пОбъектыРемонта,пЗависимыеОбъектыРемонта)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыРемонта.ID_ОбъектаРемонта КАК ID,
	               |	ОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта
	               |ПОМЕСТИТЬ ОбъектыРемонта
	               |ИЗ
	               |	&ОбъектыРемонта КАК ОбъектыРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗависимыеОбъектыРемонта.ID_ВышестоящегоОбъекта КАК ID_ВышестоящегоОбъекта,
	               |	ЗависимыеОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
	               |	ЗависимыеОбъектыРемонта.ПараметрНаработки,
				   |	ЗависимыеОбъектыРемонта.Организация КАК ОрганизацияЗависимогоОР,
	               |	ЗависимыеОбъектыРемонта.Подразделение КАК ПодразделениеЗависимогоОР,
				   |	ЗависимыеОбъектыРемонта.Направление КАК НаправлениеЗависимогоОР,
	               |	ЗависимыеОбъектыРемонта.ТипОбъектаРемонта КАК ТипОРЗависимогоОбъектаРемонта,
	               |	ЗависимыеОбъектыРемонта.КоэффициентПересчета,
	               |	ЗависимыеОбъектыРемонта.ДатаВвода
	               |ПОМЕСТИТЬ ЗависимыеОбъектыРемонта
	               |ИЗ
	               |	&ЗависимыеОбъектыРемонта КАК ЗависимыеОбъектыРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыРемонта.ОбъектРемонта,
				   |	ЗависимыеОбъектыРемонта.ОрганизацияЗависимогоОР КАК ОрганизацияЗависимогоОР,
	               |	ЗависимыеОбъектыРемонта.ПодразделениеЗависимогоОР КАК ПодразделениеЗависимогоОР,
				   |	ЗависимыеОбъектыРемонта.НаправлениеЗависимогоОР КАК НаправлениеЗависимогоОР,
	               |	ЗависимыеОбъектыРемонта.ТипОРЗависимогоОбъектаРемонта КАК ТипОРЗависимогоОбъектаРемонта,
	               |	ЗависимыеОбъектыРемонта.ОбъектРемонта КАК ЗависимыйОбъектРемонта,
	               |	ЗависимыеОбъектыРемонта.ПараметрНаработки,
	               |	ЗависимыеОбъектыРемонта.КоэффициентПересчета,
	               |	ЗависимыеОбъектыРемонта.ДатаВвода
	               |ИЗ
	               |	ЗависимыеОбъектыРемонта КАК ЗависимыеОбъектыРемонта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРемонта КАК ОбъектыРемонта
	               |		ПО ЗависимыеОбъектыРемонта.ID_ВышестоящегоОбъекта = ОбъектыРемонта.ID";
					
	Запрос.УстановитьПараметр("ОбъектыРемонта",пОбъектыРемонта);
	Запрос.УстановитьПараметр("ЗависимыеОбъектыРемонта",пЗависимыеОбъектыРемонта);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
#КонецОбласти

#КонецЕсли
